InformationRegisters/СтатистикаИспользованияСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаИспользованияСервисов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Частота</Name>
					<Comment>Значение только 1 (еденица)!</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>user_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СборСтатистикиСервер/Ext/Module.bsl
Процедура ЗаписатьФактИспользованияСервиса(ВидСтатистики, СразуОтправитьВДатаЦентр = Ложь) Экспорт
	Попытка
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ПериодРегистрации", ТекущаяДата());
		СтруктураДанных.Вставить("УниверсальнаяДата", ТекущаяУниверсальнаяДата());
		СтруктураДанных.Вставить("User_id", Константы.user_id.Получить());
		СтруктураДанных.Вставить("ЧасовойПояс", ЧасовойПоясСеанса());
		СтруктураДанных.Вставить("ВидСтатистики", ВидСтатистики);
		СтруктураДанных.Вставить("Частота", 1);
		
		Если СразуОтправитьВДатаЦентр Тогда
			ТелоСтроки = СтрШаблон("date=%1;uDate=%2;GMT=%3;user_id=%4;typeStat=%5", XMLСтрока(ПериодРегистрации), XMLСтрока(УниверсальнаяДата), ЧасовойПояс(), user_id, Перечисления.ВидыСтатистики.Индекс(ВидСтатистики));		
			ОтветСервера = ЗапросыHTTP_Сервер.ОтправитьСтатистикуВДатаЦентр(ТелоСтроки);
		Иначе
			ОтветСервера = 666;
		КонецЕсли;
		
		СтруктураДанных.Вставить("Отправлено", ОтветСервера = 200);
		
		МенеджерЗаписи = РегистрыСведений.СтатистикаИспользованияСервисов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ПериодРегистрации;
		МенеджерЗаписи.УниверсальнаяДата = УниверсальнаяДата;
		МенеджерЗаписи.ЧасовойПояс = ЧасовойПояс();
		МенеджерЗаписи.user_id = user_id;
		МенеджерЗаписи.ВидСтатистики = ВидСтатистики;
		МенеджерЗаписи.Частота = 1;
		МенеджерЗаписи.Отправлено = ОтветСервера = 200;
		МенеджерЗаписи.Записать(Ложь);
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщиеПроцедурыИФункцииСервер.ЗаписатьЛоги(Ошибка);
	КонецПопытки;
КонецПроцедуры
